wsdl-schema-parser/src/test/resources/wsdls/xmethods/http.__www.schemaweb.info_webservices_soap_SchemaWebSoap.asmx_wsdl.wsdl

<?xml version="1.0" encoding="utf-8"?><definitions xmlns:t="http://www.schemaweb.info/2003/types/" 			   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 			   xmlns:xs="http://www.w3.org/2001/XMLSchema" 			   xmlns:m="http://www.schemaweb.info/webservices/methods/" 			   xmlns:ws="http://www.schemaweb.info/webservices/" 			   targetNamespace="http://www.schemaweb.info/webservices/" 			   xmlns="http://schemas.xmlsoap.org/wsdl/">	<types>		<xs:schema elementFormDefault="qualified" targetNamespace="http://www.schemaweb.info/webservices/methods/">			<xs:import namespace="http://www.schemaweb.info/2003/types/"/>			<xs:element name="GetRDF">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:namespace"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRDFResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:rdf"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRDFTriples">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:namespace"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRDFTriplesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:statements"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRDFNTriples">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:namespace"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRDFNTriplesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:n-triples"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSchemaLocation">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:namespace" />					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSchemaLocationResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:location" />					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubjects">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:predicate"/>						<xs:element ref="t:object"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubjectsResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:subjects"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetObjects">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:subject"/>						<xs:element ref="t:predicate"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetObjectsResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:objects"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubClasses">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:class"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubClassesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:classes"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSuperClasses">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:class"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSuperClassesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:classes"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubProperties">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:property"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSubPropertiesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:properties"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSuperProperties">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:property"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetSuperPropertiesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:properties"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetDomains">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:property"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetDomainsResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:classes"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetDomainProperties">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:class"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetDomainPropertiesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:properties"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRanges">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:property"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRangesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:classes"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRangeProperties">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:class"/>					</xs:sequence>				</xs:complexType>			</xs:element>			<xs:element name="GetRangePropertiesResponse">				<xs:complexType>					<xs:sequence>						<xs:element ref="t:properties"/>					</xs:sequence>				</xs:complexType>			</xs:element>		</xs:schema>		<xs:schema elementFormDefault="qualified" targetNamespace="http://www.schemaweb.info/2003/types/">			<xs:complexType name="Statements">				<xs:sequence>					<xs:element minOccurs="0" maxOccurs="unbounded" name="statement" type="t:Statement"/>				</xs:sequence>			</xs:complexType>			<xs:complexType name="Subjects">				<xs:sequence>					<xs:element minOccurs="0" maxOccurs="unbounded" name="subject" type="t:Subject"/>				</xs:sequence>			</xs:complexType>			<xs:complexType name="Objects">				<xs:sequence>					<xs:element minOccurs="0" maxOccurs="unbounded" name="object" type="t:Object"/>				</xs:sequence>			</xs:complexType>			<xs:complexType name="Statement">				<xs:sequence>					<xs:element name="subject" type="t:Subject"/>					<xs:element name="predicate" type="t:Predicate"/>					<xs:element name="object" type="t:Object"/>				</xs:sequence>			</xs:complexType>			<xs:complexType name="Subject">				<xs:simpleContent>					<xs:extension base="xs:string">						<xs:attribute name="type" type="t:SubjectTypeType" use="required"/>					</xs:extension>				</xs:simpleContent>			</xs:complexType>			<xs:simpleType name="SubjectTypeType">				<xs:restriction base="xs:string">					<xs:enumeration value="uri"/>					<xs:enumeration value="anonymous"/>					<xs:enumeration value="blank"/>				</xs:restriction>			</xs:simpleType>			<xs:complexType name="Predicate">				<xs:simpleContent>					<xs:extension base="xs:string"/>				</xs:simpleContent>			</xs:complexType>			<xs:complexType name="Object">				<xs:simpleContent>					<xs:extension base="xs:string">						<xs:attribute name="type" type="t:ObjectTypeType" use="required"/>						<xs:attribute name="data-type" type="xs:string"/>						<xs:attribute name="lang" type="xs:string"/>					</xs:extension>				</xs:simpleContent>			</xs:complexType>			<xs:simpleType name="ObjectTypeType">				<xs:restriction base="xs:string">					<xs:enumeration value="uri"/>					<xs:enumeration value="anonymous"/>					<xs:enumeration value="blank"/>					<xs:enumeration value="literal"/>					<xs:enumeration value="xml"/>				</xs:restriction>			</xs:simpleType>			<xs:complexType name="Classes">				<xs:sequence>					<xs:element minOccurs="0" maxOccurs="unbounded" ref="t:class"/>				</xs:sequence>			</xs:complexType>			<xs:complexType name="Properties">				<xs:sequence>					<xs:element minOccurs="0" maxOccurs="unbounded" ref="t:property"/>				</xs:sequence>			</xs:complexType>			<xs:element name="statements" type="t:Statements"/>			<xs:element name="subjects" type="t:Subjects"/>			<xs:element name="objects" type="t:Objects"/>			<xs:element name="classes" type="t:Classes"/>			<xs:element name="properties" type="t:Properties"/>			<xs:element name="namespace" type="xs:string"/>			<xs:element name="subject" type="xs:string"/>			<xs:element name="predicate" type="xs:string"/>			<xs:element name="object" type="xs:string"/>			<xs:element name="rdf" type="xs:string"/>			<xs:element name="n-triples" type="xs:string"/>			<xs:element name="class" type="xs:string"/>			<xs:element name="property" type="xs:string"/>			<xs:element name="location" type="xs:string" />		</xs:schema>	</types>	<message name="GetRDFSoapIn">		<part name="parameters" element="m:GetRDF"/>	</message>	<message name="GetRDFSoapOut">		<part name="parameters" element="m:GetRDFResponse"/>	</message>	<message name="GetRDFTriplesSoapIn">		<part name="parameters" element="m:GetRDFTriples"/>	</message>	<message name="GetRDFTriplesSoapOut">		<part name="parameters" element="m:GetRDFTriplesResponse"/>	</message>	<message name="GetRDFNTriplesSoapIn">		<part name="parameters" element="m:GetRDFNTriples"/>	</message>	<message name="GetRDFNTriplesSoapOut">		<part name="parameters" element="m:GetRDFNTriplesResponse"/>	</message>	<message name="GetSchemaLocationSoapIn">		<part name="parameters" element="m:GetSchemaLocation" />	</message>	<message name="GetSchemaLocationSoapOut">		<part name="parameters" element="m:GetSchemaLocationResponse" />	</message>	<message name="GetSubjectsSoapIn">		<part name="parameters" element="m:GetSubjects"/>	</message>	<message name="GetSubjectsSoapOut">		<part name="parameters" element="m:GetSubjectsResponse"/>	</message>	<message name="GetObjectsSoapIn">		<part name="parameters" element="m:GetObjects"/>	</message>	<message name="GetObjectsSoapOut">		<part name="parameters" element="m:GetObjectsResponse"/>	</message>	<message name="GetSubClassesSoapIn">		<part name="parameters" element="m:GetSubClasses"/>	</message>	<message name="GetSubClassesSoapOut">		<part name="parameters" element="m:GetSubClassesResponse"/>	</message>	<message name="GetSuperClassesSoapIn">		<part name="parameters" element="m:GetSuperClasses"/>	</message>	<message name="GetSuperClassesSoapOut">		<part name="parameters" element="m:GetSuperClassesResponse"/>	</message>	<message name="GetSubPropertiesSoapIn">		<part name="parameters" element="m:GetSubProperties"/>	</message>	<message name="GetSubPropertiesSoapOut">		<part name="parameters" element="m:GetSubPropertiesResponse"/>	</message>	<message name="GetSuperPropertiesSoapIn">		<part name="parameters" element="m:GetSuperProperties"/>	</message>	<message name="GetSuperPropertiesSoapOut">		<part name="parameters" element="m:GetSuperPropertiesResponse"/>	</message>	<message name="GetDomainsSoapIn">		<part name="parameters" element="m:GetDomains"/>	</message>	<message name="GetDomainsSoapOut">		<part name="parameters" element="m:GetDomainsResponse"/>	</message>	<message name="GetDomainPropertiesSoapIn">		<part name="parameters" element="m:GetDomainProperties"/>	</message>	<message name="GetDomainPropertiesSoapOut">		<part name="parameters" element="m:GetDomainPropertiesResponse"/>	</message>	<message name="GetRangesSoapIn">		<part name="parameters" element="m:GetRanges"/>	</message>	<message name="GetRangesSoapOut">		<part name="parameters" element="m:GetRangesResponse"/>	</message>	<message name="GetRangePropertiesSoapIn">		<part name="parameters" element="m:GetRangeProperties"/>	</message>	<message name="GetRangePropertiesSoapOut">		<part name="parameters" element="m:GetRangePropertiesResponse"/>	</message>	<portType name="SchemaWebSoap">		<operation name="GetRDF">			<input message="ws:GetRDFSoapIn"/>			<output message="ws:GetRDFSoapOut"/>		</operation>		<operation name="GetRDFTriples">			<input message="ws:GetRDFTriplesSoapIn"/>			<output message="ws:GetRDFTriplesSoapOut"/>		</operation>		<operation name="GetRDFNTriples">			<input message="ws:GetRDFNTriplesSoapIn"/>			<output message="ws:GetRDFNTriplesSoapOut"/>		</operation>		<operation name="GetSchemaLocation">			<input message="ws:GetSchemaLocationSoapIn" />			<output message="ws:GetSchemaLocationSoapOut" />		</operation>		<operation name="GetSubjects">			<input message="ws:GetSubjectsSoapIn"/>			<output message="ws:GetSubjectsSoapOut"/>		</operation>		<operation name="GetObjects">			<input message="ws:GetObjectsSoapIn"/>			<output message="ws:GetObjectsSoapOut"/>		</operation>		<operation name="GetSubClasses">			<input message="ws:GetSubClassesSoapIn"/>			<output message="ws:GetSubClassesSoapOut"/>		</operation>		<operation name="GetSuperClasses">			<input message="ws:GetSuperClassesSoapIn"/>			<output message="ws:GetSuperClassesSoapOut"/>		</operation>		<operation name="GetSubProperties">			<input message="ws:GetSubPropertiesSoapIn"/>			<output message="ws:GetSubPropertiesSoapOut"/>		</operation>		<operation name="GetSuperProperties">			<input message="ws:GetSuperPropertiesSoapIn"/>			<output message="ws:GetSuperPropertiesSoapOut"/>		</operation>		<operation name="GetDomains">			<input message="ws:GetDomainsSoapIn"/>			<output message="ws:GetDomainsSoapOut"/>		</operation>		<operation name="GetDomainProperties">			<input message="ws:GetDomainPropertiesSoapIn"/>			<output message="ws:GetDomainPropertiesSoapOut"/>		</operation>		<operation name="GetRanges">			<input message="ws:GetRangesSoapIn"/>			<output message="ws:GetRangesSoapOut"/>		</operation>		<operation name="GetRangeProperties">			<input message="ws:GetRangePropertiesSoapIn"/>			<output message="ws:GetRangePropertiesSoapOut"/>		</operation>	</portType>	<binding name="SchemaWebSoap" type="ws:SchemaWebSoap">		<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>		<operation name="GetRDF">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetRDF" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetRDFTriples">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetRDFTriples" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetRDFNTriples">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetRDFNTriples" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetSchemaLocation">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSchemaLocation" style="document" />			<input>				<soap:body use="literal" />			</input>			<output>				<soap:body use="literal" />			</output>		</operation>		<operation name="GetSubjects">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSubjects" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetObjects">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetObjects" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetSubClasses">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSubClasses" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetSuperClasses">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSuperClasses" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetSubProperties">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSubProperties" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetSuperProperties">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetSuperProperties" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetDomains">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetDomains" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetDomainProperties">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetDomainProperties" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetRanges">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetRanges" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>		<operation name="GetRangeProperties">			<soap:operation soapAction="http://www.schemaweb.info/webservices/methods/GetRangeProperties" style="document"/>			<input>				<soap:body use="literal"/>			</input>			<output>				<soap:body use="literal"/>			</output>		</operation>	</binding>	<service name="SchemaWeb">		<documentation>A SOAP interface to the SchemaWeb directory and triples store conforming to the SOAP (Simple Object Access Protocol) 1.1 specification.</documentation>		<port name="SchemaWebSoap" binding="ws:SchemaWebSoap">			<soap:address location="http://www.schemaweb.info/webservices/soap/SchemaWebSoap.asmx"/>		</port>	</service></definitions>